## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to move, 0 to add, 4 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               RESOURCE                                |
|--------|-----------------------------------------------------------------------|
| update | `aws_athena_data_catalog.data_lake[&quot;production&quot;]`                     |
|        | `aws_iam_policy.superset_athena_read[&quot;operations_aws_production&quot;]`    |
|        | `aws_iam_policy.superset_athena_read[&quot;platform_gc_forms_production&quot;]` |
|        | `aws_iam_policy.superset_athena_read[&quot;platform_support_production&quot;]`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.glue_database["operations_aws_production"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "glue_database" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "glue:BatchGetPartition",
              + "glue:GetDatabase",
              + "glue:GetDatabases",
              + "glue:GetPartition",
              + "glue:GetPartitions",
              + "glue:GetTable",
              + "glue:GetTableVersion",
              + "glue:GetTableVersions",
              + "glue:GetTables",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production",
              + "arn:aws:glue:ca-central-1:739275439843:catalog",
              + "arn:aws:glue:ca-central-1:739275439843:database/operations_aws_production",
              + "arn:aws:glue:ca-central-1:739275439843:table/operations_aws_production/*",
            ]
          + sid       = "GlueRead"
        }
    }

  # data.aws_iam_policy_document.glue_database["platform_gc_forms_production"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "glue_database" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "glue:BatchGetPartition",
              + "glue:GetDatabase",
              + "glue:GetDatabases",
              + "glue:GetPartition",
              + "glue:GetPartitions",
              + "glue:GetTable",
              + "glue:GetTableVersion",
              + "glue:GetTableVersions",
              + "glue:GetTables",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production",
              + "arn:aws:glue:ca-central-1:739275439843:catalog",
              + "arn:aws:glue:ca-central-1:739275439843:database/platform_gc_forms_production",
              + "arn:aws:glue:ca-central-1:739275439843:table/platform_gc_forms_production/*",
            ]
          + sid       = "GlueRead"
        }
    }

  # data.aws_iam_policy_document.glue_database["platform_support_production"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "glue_database" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "glue:BatchGetPartition",
              + "glue:GetDatabase",
              + "glue:GetDatabases",
              + "glue:GetPartition",
              + "glue:GetPartitions",
              + "glue:GetTable",
              + "glue:GetTableVersion",
              + "glue:GetTableVersions",
              + "glue:GetTables",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production",
              + "arn:aws:glue:ca-central-1:739275439843:catalog",
              + "arn:aws:glue:ca-central-1:739275439843:database/platform_support_production",
              + "arn:aws:glue:ca-central-1:739275439843:table/platform_support_production/*",
            ]
          + sid       = "GlueRead"
        }
    }

  # data.aws_iam_policy_document.superset_athena_read will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "superset_athena_read" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetDataCatalog",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production",
            ]
          + sid       = "AthenaDataCatalogAccess"
        }
      + statement {
          + actions   = [
              + "athena:BatchGetNamedQuery",
              + "athena:BatchGetQueryExecution",
              + "athena:CreatePreparedStatement",
              + "athena:DeletePreparedStatement",
              + "athena:GetNamedQuery",
              + "athena:GetPreparedStatement",
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:GetQueryResultsStream",
              + "athena:GetTableMetadata",
              + "athena:GetWorkGroup",
              + "athena:ListDataCatalogs",
              + "athena:ListDatabases",
              + "athena:ListNamedQueries",
              + "athena:ListQueryExecutions",
              + "athena:ListTableMetadata",
              + "athena:ListTagsForResource",
              + "athena:ListWorkGroups",
              + "athena:StartQueryExecution",
              + "athena:StopQueryExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AthenaRead"
        }
      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-curated-production",
              + "arn:aws:s3:::cds-data-lake-curated-production/*",
              + "arn:aws:s3:::cds-data-lake-transformed-production",
              + "arn:aws:s3:::cds-data-lake-transformed-production/*",
            ]
          + sid       = "S3AthenaSourceBucketRead"
        }
      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-athena-production",
              + "arn:aws:s3:::cds-data-lake-athena-production/*",
            ]
          + sid       = "S3AthenaResultBucketWrite"
        }
    }

  # data.aws_iam_policy_document.superset_athena_read_combined["operations_aws_production"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "superset_athena_read_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
        ]
    }

  # data.aws_iam_policy_document.superset_athena_read_combined["platform_gc_forms_production"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "superset_athena_read_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
        ]
    }

  # data.aws_iam_policy_document.superset_athena_read_combined["platform_support_production"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "superset_athena_read_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
        ]
    }

  # aws_athena_data_catalog.data_lake["production"] will be updated in-place
  # (moved from aws_athena_data_catalog.data_lake)
  ~ resource "aws_athena_data_catalog" "data_lake" {
      ~ description = "Data catalog for access to the CDS data lake" -> "Data catalog for access to the CDS Data Lake production environment"
        id          = "data-lake-production"
        name        = "data-lake-production"
        tags        = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.superset_athena_read["operations_aws_production"] will be updated in-place
  ~ resource "aws_iam_policy" "superset_athena_read" {
        id               = "arn:aws:iam::066023111852:policy/SupersetAthenaRead-operations_aws_production"
        name             = "SupersetAthenaRead-operations_aws_production"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "athena:GetDataCatalog"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production"
                      - Sid      = "AthenaDataCatalogAccess"
                    },
                  - {
                      - Action   = [
                          - "athena:StopQueryExecution",
                          - "athena:StartQueryExecution",
                          - "athena:ListWorkGroups",
                          - "athena:ListTagsForResource",
                          - "athena:ListTableMetadata",
                          - "athena:ListQueryExecutions",
                          - "athena:ListNamedQueries",
                          - "athena:ListDatabases",
                          - "athena:ListDataCatalogs",
                          - "athena:GetWorkGroup",
                          - "athena:GetTableMetadata",
                          - "athena:GetQueryResultsStream",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                          - "athena:GetPreparedStatement",
                          - "athena:GetNamedQuery",
                          - "athena:DeletePreparedStatement",
                          - "athena:CreatePreparedStatement",
                          - "athena:BatchGetQueryExecution",
                          - "athena:BatchGetNamedQuery",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AthenaRead"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-data-lake-transformed-production/*",
                          - "arn:aws:s3:::cds-data-lake-transformed-production",
                          - "arn:aws:s3:::cds-data-lake-curated-production/*",
                          - "arn:aws:s3:::cds-data-lake-curated-production",
                        ]
                      - Sid      = "S3AthenaSourceBucketRead"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-data-lake-athena-production/*",
                          - "arn:aws:s3:::cds-data-lake-athena-production",
                        ]
                      - Sid      = "S3AthenaResultBucketWrite"
                    },
                  - {
                      - Action   = [
                          - "glue:GetTables",
                          - "glue:GetTableVersions",
                          - "glue:GetTableVersion",
                          - "glue:GetTable",
                          - "glue:GetPartitions",
                          - "glue:GetPartition",
                          - "glue:GetDatabases",
                          - "glue:GetDatabase",
                          - "glue:BatchGetPartition",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:glue:ca-central-1:739275439843:table/operations_aws_production/*",
                          - "arn:aws:glue:ca-central-1:739275439843:database/operations_aws_production",
                          - "arn:aws:glue:ca-central-1:739275439843:catalog",
                          - "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production",
                        ]
                      - Sid      = "GlueRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.superset_athena_read["platform_gc_forms_production"] will be updated in-place
  ~ resource "aws_iam_policy" "superset_athena_read" {
        id               = "arn:aws:iam::066023111852:policy/SupersetAthenaRead-platform_gc_forms_production"
        name             = "SupersetAthenaRead-platform_gc_forms_production"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "athena:GetDataCatalog"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production"
                      - Sid      = "AthenaDataCatalogAccess"
                    },
                  - {
                      - Action   = [
                          - "athena:StopQueryExecution",
                          - "athena:StartQueryExecution",
                          - "athena:ListWorkGroups",
                          - "athena:ListTagsForResource",
                          - "athena:ListTableMetadata",
                          - "athena:ListQueryExecutions",
                          - "athena:ListNamedQueries",
                          - "athena:ListDatabases",
                          - "athena:ListDataCatalogs",
                          - "athena:GetWorkGroup",
                          - "athena:GetTableMetadata",
                          - "athena:GetQueryResultsStream",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                          - "athena:GetPreparedStatement",
                          - "athena:GetNamedQuery",
                          - "athena:DeletePreparedStatement",
                          - "athena:CreatePreparedStatement",
                          - "athena:BatchGetQueryExecution",
                          - "athena:BatchGetNamedQuery",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AthenaRead"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-data-lake-transformed-production/*",
                          - "arn:aws:s3:::cds-data-lake-transformed-production",
                          - "arn:aws:s3:::cds-data-lake-curated-production/*",
                          - "arn:aws:s3:::cds-data-lake-curated-production",
                        ]
                      - Sid      = "S3AthenaSourceBucketRead"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-data-lake-athena-production/*",
                          - "arn:aws:s3:::cds-data-lake-athena-production",
                        ]
                      - Sid      = "S3AthenaResultBucketWrite"
                    },
                  - {
                      - Action   = [
                          - "glue:GetTables",
                          - "glue:GetTableVersions",
                          - "glue:GetTableVersion",
                          - "glue:GetTable",
                          - "glue:GetPartitions",
                          - "glue:GetPartition",
                          - "glue:GetDatabases",
                          - "glue:GetDatabase",
                          - "glue:BatchGetPartition",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:glue:ca-central-1:739275439843:table/platform_gc_forms_production/*",
                          - "arn:aws:glue:ca-central-1:739275439843:database/platform_gc_forms_production",
                          - "arn:aws:glue:ca-central-1:739275439843:catalog",
                          - "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production",
                        ]
                      - Sid      = "GlueRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.superset_athena_read["platform_support_production"] will be updated in-place
  ~ resource "aws_iam_policy" "superset_athena_read" {
        id               = "arn:aws:iam::066023111852:policy/SupersetAthenaRead-platform_support_production"
        name             = "SupersetAthenaRead-platform_support_production"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "athena:GetDataCatalog"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production"
                      - Sid      = "AthenaDataCatalogAccess"
                    },
                  - {
                      - Action   = [
                          - "athena:StopQueryExecution",
                          - "athena:StartQueryExecution",
                          - "athena:ListWorkGroups",
                          - "athena:ListTagsForResource",
                          - "athena:ListTableMetadata",
                          - "athena:ListQueryExecutions",
                          - "athena:ListNamedQueries",
                          - "athena:ListDatabases",
                          - "athena:ListDataCatalogs",
                          - "athena:GetWorkGroup",
                          - "athena:GetTableMetadata",
                          - "athena:GetQueryResultsStream",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                          - "athena:GetPreparedStatement",
                          - "athena:GetNamedQuery",
                          - "athena:DeletePreparedStatement",
                          - "athena:CreatePreparedStatement",
                          - "athena:BatchGetQueryExecution",
                          - "athena:BatchGetNamedQuery",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AthenaRead"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-data-lake-transformed-production/*",
                          - "arn:aws:s3:::cds-data-lake-transformed-production",
                          - "arn:aws:s3:::cds-data-lake-curated-production/*",
                          - "arn:aws:s3:::cds-data-lake-curated-production",
                        ]
                      - Sid      = "S3AthenaSourceBucketRead"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-data-lake-athena-production/*",
                          - "arn:aws:s3:::cds-data-lake-athena-production",
                        ]
                      - Sid      = "S3AthenaResultBucketWrite"
                    },
                  - {
                      - Action   = [
                          - "glue:GetTables",
                          - "glue:GetTableVersions",
                          - "glue:GetTableVersion",
                          - "glue:GetTable",
                          - "glue:GetPartitions",
                          - "glue:GetPartition",
                          - "glue:GetDatabases",
                          - "glue:GetDatabase",
                          - "glue:BatchGetPartition",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:glue:ca-central-1:739275439843:table/platform_support_production/*",
                          - "arn:aws:glue:ca-central-1:739275439843:database/platform_support_production",
                          - "arn:aws:glue:ca-central-1:739275439843:catalog",
                          - "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production",
                        ]
                      - Sid      = "GlueRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

lifecycle_rule is deprecated. Use the aws_s3_bucket_lifecycle_configuration
resource instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
